meal_match/app/views/ingredient_list_recipes/show.html.erb

SELECT "ingredients"."title" FROM "ingredients" INNER JOIN "ingredient_list_items" ON "ingredients"."id" = "ingredient_list_items"."ingredient_id" WHERE "ingredient_list_items"."ingredient_list_id" = 24
---
      <% if @ingredient_list.present? %>
        <%= @ingredient_list.ingredients.pluck(:title).join(", ") %>