meal_match/app/controllers/oauth/google_oauth2_controller.rb

    def callback
      # authentication payload
      auth = request.env["omniauth.auth"]

      # Origin: The page from which we received this request, in case
      # we want to send the user back
      origin = request.env["omniauth.origin"]

      user = User.find_or_initialize_by(email: auth.info.email)
      user.attributes = {
        first_name: auth.info.first_name,
        last_name: auth.info.last_name
      }
      user.save!

      # Session is a global object provided by ruby to maintain the
      # state of a session, so we are using it in a way to store that
      # a user has logged in
      session[:user_id] = user.id

      # Returns an existing User account if exists or creates
      # a new object (maybe not saveable state) of UserAccount
      # that may need some additional property setting after this
      # creation
      user_account = UserAccount.find_or_initialize_by(
        provider: auth.provider,
        provider_account_id: auth.provider_account_id
      )
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'qacer6973@gmail.com' LIMIT 1
SELECT "user_accounts".* FROM "user_accounts" WHERE "user_accounts"."provider" = 'google_oauth2' AND "user_accounts"."provider_account_id" IS NULL LIMIT 1