meal_match/app/controllers/ingredient_list_recipes_controller.rb

SELECT "ingredients"."title" FROM "ingredients" INNER JOIN "ingredient_list_items" ON "ingredients"."id" = "ingredient_list_items"."ingredient_id" WHERE "ingredient_list_items"."ingredient_list_id" = 23
---
  def show
    ingredients = @ingredient_list.ingredients.pluck(:title)

SELECT "ingredient_lists".* FROM "ingredient_lists" WHERE "ingredient_lists"."user_id" = 8 AND "ingredient_lists"."id" = 25 LIMIT 1
---
  def set_ingredient_list
    @ingredient_list = current_user.ingredient_lists.find(params[:id])