meal_match/app/controllers/recipe_searches_controller.rb

  def show
    if @recipe_search.ingredient_list_id.present?
      @ingredient_list = @recipe_search.ingredient_list
      ingredients = @ingredient_list.ingredients.pluck(:title)
---
SELECT "ingredients"."title" FROM "ingredients" INNER JOIN "ingredient_list_items" ON "ingredients"."id" = "ingredient_list_items"."ingredient_id" WHERE "ingredient_list_items"."ingredient_list_id" = 23

  def create
    @recipe_search = RecipeSearch.new(recipe_search_params)

    if @recipe_search.save
---
INSERT INTO "recipe_searches" ("ingredients", "created_at", "updated_at", "ingredient_list_id") VALUES ('', '2025-09-23 23:42:54.303962', '2025-09-23 23:42:54.303962', 24) RETURNING "id"

  def set_recipe_search
    @recipe_search = RecipeSearch.find(params[:id])
---
SELECT "recipe_searches".* FROM "recipe_searches" WHERE "recipe_searches"."id" = 45 LIMIT 1