meal_match/app/controllers/saved_recipes_controller.rb

  def create
    recipe = current_user.saved_recipes.new(
      meal_id: params[:meal_id],
      name: params[:name],
      thumbnail: params[:thumbnail]
    )

    if recipe.save
---
INSERT INTO "saved_recipes" ("user_id", "meal_id", "name", "thumbnail", "category", "area", "description", "created_at", "updated_at") VALUES (8, '52846', 'Chicken & mushroom Hotpot', 'https://www.themealdb.com/images/media/meals/uuuspp1511297945.jpg', 'Chicken', 'British', 'Heat oven to 200C/180C fan/gas 6. Put the butter in a medium-size saucepan and place over a medium heat. Add the onion and leave to cook for 5 mins, stirring occasionally. Add the mushrooms to the saucepan with the onions.
INSERT INTO "saved_recipes" ("user_id", "meal_id", "name", "thumbnail", "created_at", "updated_at") VALUES (8, '52796', 'Chicken Alfredo Primavera', 'https://www.themealdb.com/images/media/meals/syqypv1486981727.jpg', '2025-09-24 02:02:11.824200', '2025-09-24 02:02:11.824200') RETURNING "id"

  def destroy
    recipe = current_user.saved_recipes.find(params[:id])
    recipe.destroy
---
SELECT "saved_recipes".* FROM "saved_recipes" WHERE "saved_recipes"."user_id" = 8 AND "saved_recipes"."id" = 1 LIMIT 1
DELETE FROM "saved_recipes" WHERE "saved_recipes"."id" = 1