meal_match/app/views/recipe_searches/show.html.erb

            <% if @ingredient_list.present? %>
                <%= @ingredient_list.ingredients.pluck(:title).join(", ") %>
---
SELECT "ingredients"."title" FROM "ingredients" INNER JOIN "ingredient_list_items" ON "ingredients"."id" = "ingredient_list_items"."ingredient_id" WHERE "ingredient_list_items"."ingredient_list_id" = 25